Конфигурация/Catalogs/ЭкземплярыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЭкземплярыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяСумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПриСохранении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ЭкземплярыОтчетов/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭкземплярыОтчетов");
		
		ЭлементБлокировки.УстановитьЗначение("Организация",		Организация);
		ЭлементБлокировки.УстановитьЗначение("Субъект",			Субъект);
		ЭлементБлокировки.УстановитьЗначение("Отчет",			Отчет);
		ЭлементБлокировки.УстановитьЗначение("Периодичность",	Периодичность);
		ЭлементБлокировки.УстановитьЗначение("Дата",			Дата);
		
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		// Блокируем область справочника
		Попытка
			Блокировка.Заблокировать();
		Исключение
			ВызватьИсключение "Не удалось установить блокировку экземпляра отчета!";
		КонецПопытки;
		
		// Контролируем отсутствие дублей
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("Субъект",		Субъект);
		Запрос.УстановитьПараметр("Отчет",			Отчет);
		Запрос.УстановитьПараметр("Периодичность",	Периодичность);
		Запрос.УстановитьПараметр("Дата",			Дата);
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭкземплярыОтчетов.Ссылка) КАК Количество
			|ИЗ
			|	Справочник.ЭкземплярыОтчетов КАК ЭкземплярыОтчетов
			|ГДЕ
			|	ЭкземплярыОтчетов.Организация = &Организация
			|	И ЭкземплярыОтчетов.Субъект = &Субъект
			|	И ЭкземплярыОтчетов.Отчет = &Отчет
			|	И ЭкземплярыОтчетов.Периодичность = &Периодичность
			|	И ЭкземплярыОтчетов.Дата = &Дата
			|	И НЕ ЭкземплярыОтчетов.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий()
			И Выборка.Количество > 1 Тогда
			
			Сообщение = СтрШаблон("Не удалось создать новый экземпляр отчета '%1' (%2) по %3 за %4! Экземпляр этого отчета уже существует.",
								Отчет,
								Периодичность,
								Субъект,
								Формат(Дата, "ДФ=dd.MM.yyyy"));
			
			ВызватьИсключение Сообщение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
